## The cost of milk to make cheese
<p>The Coronavirus outbreak has caused major economic disruption. The pandemic's impact on the tourism, travel, and hospitality industries has featured frequently in 2020 news reports, but the economic impact has not been isolated to these industries alone. </p>
<p>The UK dairy industry is one such affected industry and has had to work together to address current market challenges and avoid milk waste. The industry can adapt to the temporary decrease in demand by identifying opportunities for processing the milk into storable products such as butter, cheese, and skimmed milk powder. </p>
<p>The UK Department of Environment, Food, and Rural Affairs has contracted your company to perform a detailed analysis of the UK dairy industry to help them understand the industry's value. </p>
<p>Your team has divided the analysis project into several tasks. One of the tasks is to determine the value of the cheddar cheese industry. The revenue from cheese is much more than, for example, whole milk, but a kilogram of cheese requires almost ten liters of raw milk to make. Your first task is to determine the annual cost of milk needed to produce cheddar cheese over the past five years. </p>
<p>You have been provided with three datasets. <em><strong>Please note that 1000 kg = 1 metric tonne.</strong></em></p>
<div style="background-color: #efebe4; color: #05192d; text-align:left; vertical-align: middle; padding: 15px 25px 15px 25px; line-height: 1.6;">
    <div style="font-size:16px"><b>datasets/milk_prices.csv - The monthly prices, volume, protein percentage and butterfat percentage of milk </b>
    </div>
Source: <a href="https://environment.data.gov.uk/linked-data/cube/explore?uri=http%3A%2F%2Fenvironment.data.gov.uk%2Flinked-data%2Fcatalog%2Fdatasets%2Fentry%2Fmilk-prices-and-composition-of-milk-annual-statistics&filters-drawer=closed">Defra Data Services Platform</a>
<ul>
    <li><b>Time: </b>The month and year when the value was recorded.</li>
    <li><b>Measure Type: </b>The type of measure recorded.</li>
    <li><b>Price:</b> The price of milk (in Pounds per liter).</li>
    <li><b>Volume:</b> The amount of milk produced (in million liters).</li>
    <li><b>Protein:</b> The protein content of the milk (percentage).</li>
    <li><b>Butterfat:</b> The butterfat content of the milk (percentage).</li>
    <li><b>Unit of Measure:</b> The units specific to the measure type.</li>
</ul>
</div>
<div style="background-color: #efebe4; color: #05192d; text-align:left; vertical-align: middle; padding: 15px 25px 15px 25px; line-height: 1.6; margin-top: 17px;">
    <div style="font-size:16px"><b>datasets/Milk_products_production.csv - The monthly production figures of milk, cream and cheddar cheese</b>
    </div>
Source: <a href="https://www.gov.uk/government/statistics/milk-utilisation-by-dairies-in-england-and-wales">GOV.UK</a>
    <ul>
        <li><b>Unnamed: 0: </b>The year and month when the value was recorded.</li>
        <li><b>Liquid Milk Production: </b>The total amount of milk produced (in million liters).</li>
        <li><b>Cream Production: </b>The total amount of cream produced (in million liters).</li>
        <li><b>Cheddar Cheese Production:</b>The total amount of cheddar cheese produced (in thousand tonnes).</li>
    </ul>
</div>
<div style="background-color: #efebe4; color: #05192d; text-align:left; vertical-align: middle; padding: 15px 25px 15px 25px; line-height: 1.6; margin-top: 17px;">    
    <div style="font-size:16px"><b>datasets/conversion_factors.xls - Liters of milk used to make one kilogram of product</b>
    </div>
Source: <a href="https://www.gov.uk/government/statistics/milk-utilisation-by-dairies-in-england-and-wales">GOV.UK</a>
    <ul>
        <li><b>Product: </b>The type of product.</li>
        <li><b>Conversion factor (litres/kg):</b> Liters of milk used to make one kilogram of product (in liters/kg).</li>
    </ul>
</div>

In [2]:
%config Completer.use_jedi = False

In [52]:
#importing necessary packages

import pandas as pd
#import matplotlib.pyplot as plt
#import seaborn as sns
import numpy as np
import datetime as dt

#reading first dataset
raw_milk = pd.read_csv('datasets/milk_prices.csv')

#renaming columns
cols = ['Date', 'Measure type', 'Price', 'Volume', 'Protein', 'Butterfat',
       'Unit of Measure']
raw_milk.columns = cols

In [53]:
#conversion and extracting datetime data
raw_milk['month'] = pd.to_datetime(raw_milk['Date'], format='%Y-%m').dt.month
raw_milk['year'] = pd.to_datetime(raw_milk['Date'], format='%Y-%m').dt.year

#inspecting dataframe
display(raw_milk.head(10))
raw_milk.info()

,Date,Measure type,Price,Volume,Protein,Butterfat,Unit of Measure,month,year
0,1986-10,Price,0.1697,NaN,NaN,NaN,Pounds per litre,10,1986
1,2000-04,Volume,NaN,1177.0,NaN,NaN,Million litres,4,2000
2,1994-12,Protein,NaN,NaN,3.21,NaN,Percentage,12,1994
3,1997-10,Price,0.2082,NaN,NaN,NaN,Pounds per litre,10,1997
4,2002-10,Protein,NaN,NaN,3.41,NaN,Percentage,10,2002
5,1998-06,Protein,NaN,NaN,3.31,NaN,Percentage,6,1998
6,2013-10,Protein,NaN,NaN,3.32,NaN,Percentage,10,2013
7,2012-05,Volume,NaN,1252.0,NaN,NaN,Million litres,5,2012
8,2001-05,Volume,NaN,1304.0,NaN,NaN,Million litres,5,2001
9,1997-05,Protein,NaN,NaN,3.33,NaN,Percentage,5,1997

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1557 entries, 0 to 1556
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Date             1557 non-null   object
 1   Measure type     1557 non-null   object
 2   Price            611 non-null    float64
 3   Volume           313 non-null    float64
 4   Protein          313 non-null    float64
 5   Butterfat        320 non-null    float64
 6   Unit of Measure  1557 non-null   object
 7   month            1557 non-null   int64
 8   year             1557 non-null   int64
dtypes: float64(4), int64(2), object(3)
memory usage: 109.6+ KB

In [54]:
#notice that the "Measure Type" column combine 4 distinct values (price, volume, protein, butterfat)
raw_milk['Measure type'].unique()

array(['Price', 'Volume', 'Protein', 'Butterfat'], dtype=object)

In [55]:
#we are only interested in Price
raw_milk = raw_milk[raw_milk['Measure type'] == 'Price']

#checking NA values for dataframe column we're interested in
raw_milk.Price.isna().sum()
#hence we can drop the column "Measure type" and focus on "Price" column

0

In [63]:
#grouping Price column by month and year where year is past 5 years
raw_milk = raw_milk[raw_milk.year > 2014]
raw_milk_price = raw_milk.groupby(['year','month'])[['Price']].sum().reset_index()

raw_milk_price.head()

   year  month   Price
0  2015      1  0.2646
1  2015      2  0.2606
2  2015      3  0.2505
3  2015      4  0.2469
4  2015      5  0.2414

In [66]:
#importing 2nd dataset
milk_production = pd.read_csv('datasets/Milk_products_production.csv')
col_production = ['Date', 'liquid_milk_production', 'cream_production',
       'cheddar_cheese_production']
milk_production.columns = col_production

milk_production.head()

#take note theres a unit on the first row
#notice the units are with comma and possibly string type

     Date liquid_milk_production cream_production cheddar_cheese_production
0     NaN         Million Litres   Million Litres           Thousand tonnes
1  Jan-15                  571,2             25,7                      24,2
2  Feb-15                  524,1             22,5                      21,3
3  Mar-15                  583,0             25,7                      26,2
4  Apr-15                  542,0             26,4                      29,3

In [67]:
#drop first row
milk_production.drop([0], inplace=True)

#conversion to datetime format
milk_production['year'] = pd.to_datetime(milk_production['Date'], format="%b-%y").dt.year
milk_production['month'] = pd.to_datetime(milk_production['Date'], format="%b-%d").dt.month

#remove non relevant columns
milk_production.drop(['liquid_milk_production','cream_production','Date'], axis=1, inplace=True)


#convert data type for relevant column
milk_production.cheddar_cheese_production = milk_production.cheddar_cheese_production.str.replace(',','.').astype('float64')
display(milk_production.info())
milk_production.head()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 72 entries, 1 to 72
Data columns (total 3 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   cheddar_cheese_production  72 non-null     float64
 1   year                       72 non-null     int64
 2   month                      72 non-null     int64
dtypes: float64(1), int64(2)
memory usage: 2.2 KB

None

   cheddar_cheese_production  year  month
1                       24.2  2015      1
2                       21.3  2015      2
3                       26.2  2015      3
4                       29.3  2015      4
5                       31.0  2015      5

In [50]:
milk_production.year.unique()

array([2015, 2016, 2017, 2018, 2019, 2020], dtype=int64)

In [70]:
#merge 1st and 2nd dataframe on month and year
merged = pd.merge(raw_milk_price, milk_production, on=['year', 'month'])
merged.head()

   year  month   Price  cheddar_cheese_production
0  2015      1  0.2646                       24.2
1  2015      2  0.2606                       21.3
2  2015      3  0.2505                       26.2
3  2015      4  0.2469                       29.3
4  2015      5  0.2414                       31.0

In [100]:
convert = pd.read_csv('datasets/conversion_factors.csv')
convert

                          Product  Conversion factor (litres/kg)
0             Butter (from Cream)                           2.04
1                         Cheddar                           9.50
2    Other Long Life Territorials                           9.20
3         Short life Territorials                           8.10
4                       Blue vein                           9.10
5                       Mozarella                           9.80
6   Cottage cheese /Fromage frais                           3.60
7                     Soft cheese                           8.00
8            Non-specified cheese                           9.70
9                  Condensed Milk                           2.70
10  Milk Powder (from Whole milk)                           8.50
11   Milk Powder (from Skim milk)                          10.10
12       Milk Powder (from Cream)                          12.30
13             Cream (from cream)                           1.00
14                        Yoghurt                           1.10

In [102]:
#notice in the conversion factor table above, we need 9.5 litre of milk for each 1kg cheese

#remember that the unit for Price is Pound/Litre

#remember that the unit for cheddar_cheese_production is thousand tonnes

#Cost = production * price * 1000 * 1000 * 9.5
merged['cost'] = merged.Price * merged.cheddar_cheese_production * 1000 * 1000 * 9.5
merged.head()

   year  month   Price  cheddar_cheese_production        cost
0  2015      1  0.2646                       24.2  60831540.0
1  2015      2  0.2606                       21.3  52732410.0
2  2015      3  0.2505                       26.2  62349450.0
3  2015      4  0.2469                       29.3  68724615.0
4  2015      5  0.2414                       31.0  71092300.0

In [125]:
#groupby year, aggregation type is sum
annual_milk_cost = merged.groupby('year')['cost'].sum()
annual_milk_cost

year
2015    702651920.0
2016    666635425.0
2017    887977635.0
2018    922553075.0
2019    896657880.0
2020    836934800.0
Name: cost, dtype: float64

In [137]:
for x,y in annual_milk_cost.iteritems():
    #print("The cost of milk for the year ", annual_milk_cost.index[x], "is ", annual_milk_cost.iloc[x,1])
    s = str(int(y))
    print("The cost of milk for the year", x, "is", "£"+s)

The cost of milk for the year 2015 is £702651920
The cost of milk for the year 2016 is £666635424
The cost of milk for the year 2017 is £887977635
The cost of milk for the year 2018 is £922553074
The cost of milk for the year 2019 is £896657880
The cost of milk for the year 2020 is £836934800